logs/close_gap_nopad_run3.log
INFO 07-01 03:07:36 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-01 03:07:36 [nixl_utils.py:34] NIXL is not available
WARNING 07-01 03:07:36 [nixl_utils.py:44] NIXL agent config is not available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75bf19f54a40>, trust_remote_code=False, seed=0, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='/data/hw3/Qwen3-8B-FP8-Dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-b277dae6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 80/80 [00:00<00:00, 915.50it/s]
/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/serve.py:913: UserWarning: All requests failed. This is likely due to a misconfiguration on the benchmark arguments.
  metrics, actual_output_lens = calculate_metrics(
Failed requests during benchmark run detected (capping to 10):
Error 0: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 1: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 2: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 3: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 4: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 5: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 6: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 7: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 8: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

Error 9: Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1301, in _wrap_create_connection
    sock = await aiohappyeyeballs.start_connection(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 124, in start_connection
    raise first_exception
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 75, in start_connection
    sock = await _connect_sock(
           ^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohappyeyeballs/impl.py", line 210, in _connect_sock
    await loop.sock_connect(sock, address)
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 651, in sock_connect
    return await fut
           ^^^^^^^^^
  File "/usr/lib/python3.12/asyncio/selector_events.py", line 691, in _sock_connect_cb
    raise OSError(err, f'Connect call failed {address}')
ConnectionRefusedError: [Errno 111] Connect call failed ('127.0.0.1', 8000)

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 197, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 1683, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 856, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/client.py", line 810, in _connect_and_send_request
    conn = await self._connector.connect(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 657, in connect
    proto = await self._create_connection(req, traces, timeout)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1242, in _create_connection
    _, proto = await self._create_direct_connection(req, traces, timeout)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1620, in _create_direct_connection
    raise last_exc
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1589, in _create_direct_connection
    transp, proto = await self._wrap_create_connection(
                    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/data/hw3/vllm_venv/lib/python3.12/site-packages/aiohttp/connector.py", line 1324, in _wrap_create_connection
    raise client_error(req.connection_key, exc) from exc
aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]

============ Serving Benchmark Result ============
Successful requests:                     0         
Failed requests:                         80        
Maximum request concurrency:             8         
Benchmark duration (s):                  0.09      
Total input tokens:                      0         
Total generated tokens:                  0         
Request throughput (req/s):              0.00      
Output token throughput (tok/s):         0.00      
Peak output token throughput (tok/s):    0.00      
Peak concurrent requests:                0.00      
Total token throughput (tok/s):          0.00      
---------------Time to First Token----------------
Mean TTFT (ms):                          0.00      
Median TTFT (ms):                        0.00      
P99 TTFT (ms):                           0.00      
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================